app/Controllers/AdminController.php

SELECT *
FROM `user_order`
WHERE `order_id` = '3'
---
    public function dashboard()
    {
        if (!session()->get('AdminLoginId')) {
            return redirect()->to('/admin/login');
        }

        $recentOrdersRaw = $this->orderModel->orderBy('Date', 'DESC')->findAll(5);
        $recentOrders = [];

        foreach ($recentOrdersRaw as $order) {
            $items = $this->orderItemModel->where('order_id', $order['id'])->findAll();

SELECT *
FROM `user_order`
---
    private function calculateTotalRevenue()
    {
        $items = $this->orderItemModel->findAll();

SELECT COUNT(*) AS `numrows`
FROM `login`
---
    public function testDatabase()
    {
        if (!session()->get('AdminLoginId')) {
            return $this->failUnauthorized('Admin not logged in.');
        }

        $db = \Config\Database::connect();

        try {
            $result = [
                'database_connection' => 'OK',
                'database_name' => $db->getDatabase(),
                'tables' => [],
                'login_table_test' => null,
                'sign_table_test' => null
            ];

            // Test table listing
            $tables = $db->listTables();
            $result['tables'] = $tables;

            // Test login table
            if (in_array('login', $tables)) {
                $loginCount = $db->table('login')->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `sign`
---

            // Test sign table
            if (in_array('sign', $tables)) {
                $signCount = $db->table('sign')->countAllResults();

SELECT *
FROM `user_order`
WHERE `order_id` = '1'
---
    public function apiOrders()
    {
        if (!session()->get('AdminLoginId')) {
            return $this->failUnauthorized('Admin not logged in.');
        }

        try {
            $ordersData = $this->orderModel->orderBy('Date', 'DESC')->findAll();
            $formattedOrders = [];

            foreach ($ordersData as $order) {
                $items = $this->orderItemModel->where('order_id', $order['id'])->findAll();

SELECT *
FROM `products`
ORDER BY `created_at` DESC
---
    public function apiProducts()
    {
        if (!session()->get('AdminLoginId')) {
            return $this->failUnauthorized('Admin not logged in.');
        }

        try {
            $products = $this->productModel->orderBy('created_at', 'DESC')->findAll();

UPDATE `products` SET `name` = 'Via - Columbia', `description` = 'This Colombian marvel erupts on the palate with a juicy feel..\r\n\r\n', `price` = '650.00', `category` = 'Drinks', `image` = 'https://starbucksstatic.cognizantorderserv.com/Items/Small/101539_1.jpg', `page` = 'gift', `updated_at` = '2025-09-06 14:43:23'
WHERE `products`.`id` IN ('31')
SELECT *
FROM `products`
WHERE `products`.`id` = '31'
---
                return $this->failValidationError('Page must be either "menu" or "gift".');
            }

            $updated = $this->productModel->update($productId, $data);

            if ($updated) {
                $updatedProduct = $this->productModel->find($productId);

DELETE FROM `products`
WHERE `id` IN ('31')
---
    public function deleteProduct($productId = null)
    {
        if (!session()->get('AdminLoginId')) {
            return $this->failUnauthorized('Admin not logged in.');
        }

        if ($productId === null) {
            return $this->fail('Product ID is missing.', 400);
        }

        try {
            $deleted = $this->productModel->delete($productId);