app/Controllers/Auth.php

SELECT *
FROM `order_manager`
WHERE `username` = 'Parth Vaghela'
ORDER BY `id` DESC
SELECT *
FROM `user_order`
WHERE `Order_Id` = '2'
---
    public function orders()
    {
        if (!session()->get('username')) {
            return redirect()->to('/login')->with('error', 'Please login to view your orders');
        }

        $db = \Config\Database::connect();
        $username = session()->get('username');

        $orders = $db->table('order_manager')
            ->where('username', $username)
            ->orderBy('id', 'DESC')
            ->get()
            ->getResultArray();

        $orderItems = [];
        foreach ($orders as $order) {
            $items = $db->table('user_order')
                ->where('Order_Id', $order['id'])
                ->get()
                ->getResultArray();