app/Controllers/Home.php

SELECT *
FROM `products`
---
    public function apiMenuProducts()
    {
        try {
            $productModel = new ProductModel();

            // Get all products first to debug
            $allProducts = $productModel->findAll();

SELECT *
FROM `products`
---
    public function apiGiftProducts()
    {
        try {
            $productModel = new ProductModel();

            // Get all products first to debug
            $allProducts = $productModel->findAll();

INSERT INTO `order_manager` (`Email`, `Phone`, `Address`, `Pay_Mode`, `username`, `Card_Number`, `Card_Expiry`, `CVV`, `Date`, `Status`) VALUES ('parth@gmail.com', '1234567890', 'Surat', 'Online', 'Parth Vaghela', '4242 4242 4242 4242', '07/26', '123', '2025-11-20', 'Approved')
---
    public function placeOrder()
    {
        if (!session()->get('username')) {
            return redirect()->to('/login')->with('error', 'Please login first');
        }

        $db = \Config\Database::connect();

        $username = session()->get('username');
        $email = $this->request->getPost('email');
        $phone = $this->request->getPost('phone');
        $address = $this->request->getPost('address');
        $pay_mode = $this->request->getPost('pay_mode');
        $card_number = $this->request->getPost('card_number') ?: null;
        $expiry = $this->request->getPost('expiry') ?: null;
        $cvv = $this->request->getPost('cvv') ?: null;
        $date = date('Y-m-d');

        // ✅ Insert into order_manager
        $builder = $db->table('order_manager');
        $builder->insert([
            'Email' => $email,
            'Phone' => $phone,
            'Address' => $address,
            'Pay_Mode' => $pay_mode,
            'username' => $username,
            'Card_Number' => $card_number,
            'Card_Expiry' => $expiry,
            'CVV' => $cvv,
            'Date' => $date,
            'Status' => 'Approved'
        ]);

INSERT INTO `user_order` (`Order_Id`, `Item_Name`, `Price`, `Quantity`, `Status`) VALUES (1, 'Java Chip Frappuccino', '441', 3, 'Approved')
---
        if (!empty($cart)) {
            $builder = $db->table('user_order');
            foreach ($cart as $item) {
                $builder->insert([
                    'Order_Id' => $order_id,
                    'Item_Name' => $item['Item_Name'],
                    'Price' => $item['Price'],
                    'Quantity' => $item['Quantity'],
                    'Status' => 'Approved'
                ]);