app/Controllers/OrderController.php

    public function downloadBill($orderId)
    {
        $orderModel = new OrderModel();
        $itemModel = new OrderItemModel();

        $order = $orderModel->find($orderId);
        if (!$order) {
            return redirect()->to('/orders')->with('error', 'Order not found!');
---
SELECT *
FROM `user_order`
WHERE `order_id` = '1'